## Exercise:

Write a pandas code to report the first name, last name, city, and state of each person in the Person table. If the address of a personId is not present in the Address table, report null instead.

Return the result table in any order.

The query result format is in the following example.

In [29]:
import pandas as pd
# Create the Person and Address tables as dataframes
# Create the Employee table as a dataframe
employee_df = pd.DataFrame({
    'id': [1, 2, 3, 5, 7],
    'salary': [100, 200, 300, 33, 5555]
})

In [30]:
employee_df.describe()

             id       salary
count  5.000000     5.000000
mean   3.600000  1237.600000
std    2.408319  2415.618202
min    1.000000    33.000000
25%    2.000000   100.000000
50%    3.000000   200.000000
75%    5.000000   300.000000
max    7.000000  5555.000000

In [31]:
employee_df.dtypes

id        int64
salary    int64
dtype: object

In [32]:
employee_df.columns

Index(['id', 'salary'], dtype='object')

In [33]:
employee_df

   id  salary
0   1     100
1   2     200
2   3     300
3   5      33
4   7    5555

In [34]:
employee_df

   id  salary
0   1     100
1   2     200
2   3     300
3   5      33
4   7    5555

In [35]:
employee_df["salaries_rank"] = employee_df["salary"].rank(ascending=False)

In [36]:
employee_df

   id  salary  salaries_rank
0   1     100            4.0
1   2     200            3.0
2   3     300            2.0
3   5      33            5.0
4   7    5555            1.0

In [37]:
cond = employee_df.salaries_rank == 2
employee_df.loc[cond].salary

2    300
Name: salary, dtype: int64

In [38]:
cond = employee_df.salaries_rank == 100
employee_df.loc[cond]

Empty DataFrame
Columns: [id, salary, salaries_rank]
Index: []

In [44]:
employee_df["salary"].nlargest(2).iloc[1]

300